set search_path "/synopsys/GPDK/SAED_EDK90nm/Digital_Standard_Cell_Library/synopsys/models"
set link_library "saed90nm_max.db"
set target_library "saed90nm_max.db"
set symbol_library "saed90nm_max.db"
analyze -library WORK -format vhdl {/grad/aljubouri/ece425/Lab4S/FullAdder.vhd}
elaborate FULLADDER -architecture BEHAVE -library WORK
write -hierarchy -format verilog -output /grad/aljubouri/ece425/Lab4S/FullAdderGen.v
link
compile -exact_map
write -hierarchy -format verilog -output /grad/aljubouri/ece425/Lab4S/FullAdderMap.v
report_area > areaFA.txt
remove_design FullAdder
