###################################################################

# Created by write_sdc on Tue Apr 12 11:17:39 2016

###################################################################
set sdc_version 1.9

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_wire_load_model -name 8000 -library saed90nm_max
set_max_area 0
set_driving_cell -lib_cell INVX1 [get_ports CK]
set_driving_cell -lib_cell INVX1 [get_ports g102]
set_driving_cell -lib_cell INVX1 [get_ports g107]
set_driving_cell -lib_cell INVX1 [get_ports g22]
set_driving_cell -lib_cell INVX1 [get_ports g23]
set_driving_cell -lib_cell INVX1 [get_ports g301]
set_driving_cell -lib_cell INVX1 [get_ports g306]
set_driving_cell -lib_cell INVX1 [get_ports g310]
set_driving_cell -lib_cell INVX1 [get_ports g314]
set_driving_cell -lib_cell INVX1 [get_ports g319]
set_driving_cell -lib_cell INVX1 [get_ports g32]
set_driving_cell -lib_cell INVX1 [get_ports g36]
set_driving_cell -lib_cell INVX1 [get_ports g37]
set_driving_cell -lib_cell INVX1 [get_ports g38]
set_driving_cell -lib_cell INVX1 [get_ports g39]
set_driving_cell -lib_cell INVX1 [get_ports g40]
set_driving_cell -lib_cell INVX1 [get_ports g41]
set_driving_cell -lib_cell INVX1 [get_ports g42]
set_driving_cell -lib_cell INVX1 [get_ports g44]
set_driving_cell -lib_cell INVX1 [get_ports g45]
set_driving_cell -lib_cell INVX1 [get_ports g46]
set_driving_cell -lib_cell INVX1 [get_ports g47]
set_driving_cell -lib_cell INVX1 [get_ports g557]
set_driving_cell -lib_cell INVX1 [get_ports g558]
set_driving_cell -lib_cell INVX1 [get_ports g559]
set_driving_cell -lib_cell INVX1 [get_ports g560]
set_driving_cell -lib_cell INVX1 [get_ports g561]
set_driving_cell -lib_cell INVX1 [get_ports g562]
set_driving_cell -lib_cell INVX1 [get_ports g563]
set_driving_cell -lib_cell INVX1 [get_ports g564]
set_driving_cell -lib_cell INVX1 [get_ports g567]
set_driving_cell -lib_cell INVX1 [get_ports g639]
set_driving_cell -lib_cell INVX1 [get_ports g702]
set_driving_cell -lib_cell INVX1 [get_ports g705]
set_driving_cell -lib_cell INVX1 [get_ports g89]
set_driving_cell -lib_cell INVX1 [get_ports g94]
set_driving_cell -lib_cell INVX1 [get_ports g98]
set_fanout_load 8 [get_ports g1290]
set_fanout_load 8 [get_ports g1293]
set_fanout_load 8 [get_ports g2584]
set_fanout_load 8 [get_ports g3222]
set_fanout_load 8 [get_ports g3600]
set_fanout_load 8 [get_ports g4098]
set_fanout_load 8 [get_ports g4099]
set_fanout_load 8 [get_ports g4100]
set_fanout_load 8 [get_ports g4101]
set_fanout_load 8 [get_ports g4102]
set_fanout_load 8 [get_ports g4103]
set_fanout_load 8 [get_ports g4104]
set_fanout_load 8 [get_ports g4105]
set_fanout_load 8 [get_ports g4106]
set_fanout_load 8 [get_ports g4107]
set_fanout_load 8 [get_ports g4108]
set_fanout_load 8 [get_ports g4109]
set_fanout_load 8 [get_ports g4110]
set_fanout_load 8 [get_ports g4112]
set_fanout_load 8 [get_ports g4121]
set_fanout_load 8 [get_ports g4307]
set_fanout_load 8 [get_ports g4321]
set_fanout_load 8 [get_ports g4422]
set_fanout_load 8 [get_ports g4809]
set_fanout_load 8 [get_ports g5137]
set_fanout_load 8 [get_ports g5468]
set_fanout_load 8 [get_ports g5469]
set_fanout_load 8 [get_ports g5692]
set_fanout_load 8 [get_ports g6282]
set_fanout_load 8 [get_ports g6284]
set_fanout_load 8 [get_ports g6360]
set_fanout_load 8 [get_ports g6362]
set_fanout_load 8 [get_ports g6364]
set_fanout_load 8 [get_ports g6366]
set_fanout_load 8 [get_ports g6368]
set_fanout_load 8 [get_ports g6370]
set_fanout_load 8 [get_ports g6372]
set_fanout_load 8 [get_ports g6374]
set_fanout_load 8 [get_ports g6728]
set_load -pin_load 20 [get_ports g1290]
set_load -pin_load 20 [get_ports g1293]
set_load -pin_load 20 [get_ports g2584]
set_load -pin_load 20 [get_ports g3222]
set_load -pin_load 20 [get_ports g3600]
set_load -pin_load 20 [get_ports g4098]
set_load -pin_load 20 [get_ports g4099]
set_load -pin_load 20 [get_ports g4100]
set_load -pin_load 20 [get_ports g4101]
set_load -pin_load 20 [get_ports g4102]
set_load -pin_load 20 [get_ports g4103]
set_load -pin_load 20 [get_ports g4104]
set_load -pin_load 20 [get_ports g4105]
set_load -pin_load 20 [get_ports g4106]
set_load -pin_load 20 [get_ports g4107]
set_load -pin_load 20 [get_ports g4108]
set_load -pin_load 20 [get_ports g4109]
set_load -pin_load 20 [get_ports g4110]
set_load -pin_load 20 [get_ports g4112]
set_load -pin_load 20 [get_ports g4121]
set_load -pin_load 20 [get_ports g4307]
set_load -pin_load 20 [get_ports g4321]
set_load -pin_load 20 [get_ports g4422]
set_load -pin_load 20 [get_ports g4809]
set_load -pin_load 20 [get_ports g5137]
set_load -pin_load 20 [get_ports g5468]
set_load -pin_load 20 [get_ports g5469]
set_load -pin_load 20 [get_ports g5692]
set_load -pin_load 20 [get_ports g6282]
set_load -pin_load 20 [get_ports g6284]
set_load -pin_load 20 [get_ports g6360]
set_load -pin_load 20 [get_ports g6362]
set_load -pin_load 20 [get_ports g6364]
set_load -pin_load 20 [get_ports g6366]
set_load -pin_load 20 [get_ports g6368]
set_load -pin_load 20 [get_ports g6370]
set_load -pin_load 20 [get_ports g6372]
set_load -pin_load 20 [get_ports g6374]
set_load -pin_load 20 [get_ports g6728]
set_max_fanout 1 [get_ports CK]
set_max_fanout 1 [get_ports g102]
set_max_fanout 1 [get_ports g107]
set_max_fanout 1 [get_ports g22]
set_max_fanout 1 [get_ports g23]
set_max_fanout 1 [get_ports g301]
set_max_fanout 1 [get_ports g306]
set_max_fanout 1 [get_ports g310]
set_max_fanout 1 [get_ports g314]
set_max_fanout 1 [get_ports g319]
set_max_fanout 1 [get_ports g32]
set_max_fanout 1 [get_ports g36]
set_max_fanout 1 [get_ports g37]
set_max_fanout 1 [get_ports g38]
set_max_fanout 1 [get_ports g39]
set_max_fanout 1 [get_ports g40]
set_max_fanout 1 [get_ports g41]
set_max_fanout 1 [get_ports g42]
set_max_fanout 1 [get_ports g44]
set_max_fanout 1 [get_ports g45]
set_max_fanout 1 [get_ports g46]
set_max_fanout 1 [get_ports g47]
set_max_fanout 1 [get_ports g557]
set_max_fanout 1 [get_ports g558]
set_max_fanout 1 [get_ports g559]
set_max_fanout 1 [get_ports g560]
set_max_fanout 1 [get_ports g561]
set_max_fanout 1 [get_ports g562]
set_max_fanout 1 [get_ports g563]
set_max_fanout 1 [get_ports g564]
set_max_fanout 1 [get_ports g567]
set_max_fanout 1 [get_ports g639]
set_max_fanout 1 [get_ports g702]
set_max_fanout 1 [get_ports g705]
set_max_fanout 1 [get_ports g89]
set_max_fanout 1 [get_ports g94]
set_max_fanout 1 [get_ports g98]
create_clock [get_ports CK]  -period 7.2  -waveform {0 3.6}
set_clock_latency 0.55  [get_clocks CK]
set_clock_uncertainty -setup 0.3  [get_clocks CK]
set_clock_uncertainty -hold 0.2  [get_clocks CK]
set_input_delay -clock CK  -max 1.2  [get_ports CK]
set_input_delay -clock CK  -min 0  [get_ports CK]
set_input_delay -clock CK  -max 1.2  [get_ports g102]
set_input_delay -clock CK  -min 0  [get_ports g102]
set_input_delay -clock CK  -max 1.2  [get_ports g107]
set_input_delay -clock CK  -min 0  [get_ports g107]
set_input_delay -clock CK  -max 1.2  [get_ports g22]
set_input_delay -clock CK  -min 0  [get_ports g22]
set_input_delay -clock CK  -max 1.2  [get_ports g23]
set_input_delay -clock CK  -min 0  [get_ports g23]
set_input_delay -clock CK  -max 1.2  [get_ports g301]
set_input_delay -clock CK  -min 0  [get_ports g301]
set_input_delay -clock CK  -max 1.2  [get_ports g306]
set_input_delay -clock CK  -min 0  [get_ports g306]
set_input_delay -clock CK  -max 1.2  [get_ports g310]
set_input_delay -clock CK  -min 0  [get_ports g310]
set_input_delay -clock CK  -max 1.2  [get_ports g314]
set_input_delay -clock CK  -min 0  [get_ports g314]
set_input_delay -clock CK  -max 1.2  [get_ports g319]
set_input_delay -clock CK  -min 0  [get_ports g319]
set_input_delay -clock CK  -max 1.2  [get_ports g32]
set_input_delay -clock CK  -min 0  [get_ports g32]
set_input_delay -clock CK  -max 1.2  [get_ports g36]
set_input_delay -clock CK  -min 0  [get_ports g36]
set_input_delay -clock CK  -max 1.2  [get_ports g37]
set_input_delay -clock CK  -min 0  [get_ports g37]
set_input_delay -clock CK  -max 1.2  [get_ports g38]
set_input_delay -clock CK  -min 0  [get_ports g38]
set_input_delay -clock CK  -max 1.2  [get_ports g39]
set_input_delay -clock CK  -min 0  [get_ports g39]
set_input_delay -clock CK  -max 1.2  [get_ports g40]
set_input_delay -clock CK  -min 0  [get_ports g40]
set_input_delay -clock CK  -max 1.2  [get_ports g41]
set_input_delay -clock CK  -min 0  [get_ports g41]
set_input_delay -clock CK  -max 1.2  [get_ports g42]
set_input_delay -clock CK  -min 0  [get_ports g42]
set_input_delay -clock CK  -max 1.2  [get_ports g44]
set_input_delay -clock CK  -min 0  [get_ports g44]
set_input_delay -clock CK  -max 1.2  [get_ports g45]
set_input_delay -clock CK  -min 0  [get_ports g45]
set_input_delay -clock CK  -max 1.2  [get_ports g46]
set_input_delay -clock CK  -min 0  [get_ports g46]
set_input_delay -clock CK  -max 1.2  [get_ports g47]
set_input_delay -clock CK  -min 0  [get_ports g47]
set_input_delay -clock CK  -max 1.2  [get_ports g557]
set_input_delay -clock CK  -min 0  [get_ports g557]
set_input_delay -clock CK  -max 1.2  [get_ports g558]
set_input_delay -clock CK  -min 0  [get_ports g558]
set_input_delay -clock CK  -max 1.2  [get_ports g559]
set_input_delay -clock CK  -min 0  [get_ports g559]
set_input_delay -clock CK  -max 1.2  [get_ports g560]
set_input_delay -clock CK  -min 0  [get_ports g560]
set_input_delay -clock CK  -max 1.2  [get_ports g561]
set_input_delay -clock CK  -min 0  [get_ports g561]
set_input_delay -clock CK  -max 1.2  [get_ports g562]
set_input_delay -clock CK  -min 0  [get_ports g562]
set_input_delay -clock CK  -max 1.2  [get_ports g563]
set_input_delay -clock CK  -min 0  [get_ports g563]
set_input_delay -clock CK  -max 1.2  [get_ports g564]
set_input_delay -clock CK  -min 0  [get_ports g564]
set_input_delay -clock CK  -max 1.2  [get_ports g567]
set_input_delay -clock CK  -min 0  [get_ports g567]
set_input_delay -clock CK  -max 1.2  [get_ports g639]
set_input_delay -clock CK  -min 0  [get_ports g639]
set_input_delay -clock CK  -max 1.2  [get_ports g702]
set_input_delay -clock CK  -min 0  [get_ports g702]
set_input_delay -clock CK  -max 1.2  [get_ports g705]
set_input_delay -clock CK  -min 0  [get_ports g705]
set_input_delay -clock CK  -max 1.2  [get_ports g89]
set_input_delay -clock CK  -min 0  [get_ports g89]
set_input_delay -clock CK  -max 1.2  [get_ports g94]
set_input_delay -clock CK  -min 0  [get_ports g94]
set_input_delay -clock CK  -max 1.2  [get_ports g98]
set_input_delay -clock CK  -min 0  [get_ports g98]
set_output_delay -clock CK  -max 1.2  [get_ports g1290]
set_output_delay -clock CK  -min 0  [get_ports g1290]
set_output_delay -clock CK  -max 1.2  [get_ports g1293]
set_output_delay -clock CK  -min 0  [get_ports g1293]
set_output_delay -clock CK  -max 1.2  [get_ports g2584]
set_output_delay -clock CK  -min 0  [get_ports g2584]
set_output_delay -clock CK  -max 1.2  [get_ports g3222]
set_output_delay -clock CK  -min 0  [get_ports g3222]
set_output_delay -clock CK  -max 1.2  [get_ports g3600]
set_output_delay -clock CK  -min 0  [get_ports g3600]
set_output_delay -clock CK  -max 1.2  [get_ports g4098]
set_output_delay -clock CK  -min 0  [get_ports g4098]
set_output_delay -clock CK  -max 1.2  [get_ports g4099]
set_output_delay -clock CK  -min 0  [get_ports g4099]
set_output_delay -clock CK  -max 1.2  [get_ports g4100]
set_output_delay -clock CK  -min 0  [get_ports g4100]
set_output_delay -clock CK  -max 1.2  [get_ports g4101]
set_output_delay -clock CK  -min 0  [get_ports g4101]
set_output_delay -clock CK  -max 1.2  [get_ports g4102]
set_output_delay -clock CK  -min 0  [get_ports g4102]
set_output_delay -clock CK  -max 1.2  [get_ports g4103]
set_output_delay -clock CK  -min 0  [get_ports g4103]
set_output_delay -clock CK  -max 1.2  [get_ports g4104]
set_output_delay -clock CK  -min 0  [get_ports g4104]
set_output_delay -clock CK  -max 1.2  [get_ports g4105]
set_output_delay -clock CK  -min 0  [get_ports g4105]
set_output_delay -clock CK  -max 1.2  [get_ports g4106]
set_output_delay -clock CK  -min 0  [get_ports g4106]
set_output_delay -clock CK  -max 1.2  [get_ports g4107]
set_output_delay -clock CK  -min 0  [get_ports g4107]
set_output_delay -clock CK  -max 1.2  [get_ports g4108]
set_output_delay -clock CK  -min 0  [get_ports g4108]
set_output_delay -clock CK  -max 1.2  [get_ports g4109]
set_output_delay -clock CK  -min 0  [get_ports g4109]
set_output_delay -clock CK  -max 1.2  [get_ports g4110]
set_output_delay -clock CK  -min 0  [get_ports g4110]
set_output_delay -clock CK  -max 1.2  [get_ports g4112]
set_output_delay -clock CK  -min 0  [get_ports g4112]
set_output_delay -clock CK  -max 1.2  [get_ports g4121]
set_output_delay -clock CK  -min 0  [get_ports g4121]
set_output_delay -clock CK  -max 1.2  [get_ports g4307]
set_output_delay -clock CK  -min 0  [get_ports g4307]
set_output_delay -clock CK  -max 1.2  [get_ports g4321]
set_output_delay -clock CK  -min 0  [get_ports g4321]
set_output_delay -clock CK  -max 1.2  [get_ports g4422]
set_output_delay -clock CK  -min 0  [get_ports g4422]
set_output_delay -clock CK  -max 1.2  [get_ports g4809]
set_output_delay -clock CK  -min 0  [get_ports g4809]
set_output_delay -clock CK  -max 1.2  [get_ports g5137]
set_output_delay -clock CK  -min 0  [get_ports g5137]
set_output_delay -clock CK  -max 1.2  [get_ports g5468]
set_output_delay -clock CK  -min 0  [get_ports g5468]
set_output_delay -clock CK  -max 1.2  [get_ports g5469]
set_output_delay -clock CK  -min 0  [get_ports g5469]
set_output_delay -clock CK  -max 1.2  [get_ports g5692]
set_output_delay -clock CK  -min 0  [get_ports g5692]
set_output_delay -clock CK  -max 1.2  [get_ports g6282]
set_output_delay -clock CK  -min 0  [get_ports g6282]
set_output_delay -clock CK  -max 1.2  [get_ports g6284]
set_output_delay -clock CK  -min 0  [get_ports g6284]
set_output_delay -clock CK  -max 1.2  [get_ports g6360]
set_output_delay -clock CK  -min 0  [get_ports g6360]
set_output_delay -clock CK  -max 1.2  [get_ports g6362]
set_output_delay -clock CK  -min 0  [get_ports g6362]
set_output_delay -clock CK  -max 1.2  [get_ports g6364]
set_output_delay -clock CK  -min 0  [get_ports g6364]
set_output_delay -clock CK  -max 1.2  [get_ports g6366]
set_output_delay -clock CK  -min 0  [get_ports g6366]
set_output_delay -clock CK  -max 1.2  [get_ports g6368]
set_output_delay -clock CK  -min 0  [get_ports g6368]
set_output_delay -clock CK  -max 1.2  [get_ports g6370]
set_output_delay -clock CK  -min 0  [get_ports g6370]
set_output_delay -clock CK  -max 1.2  [get_ports g6372]
set_output_delay -clock CK  -min 0  [get_ports g6372]
set_output_delay -clock CK  -max 1.2  [get_ports g6374]
set_output_delay -clock CK  -min 0  [get_ports g6374]
set_output_delay -clock CK  -max 1.2  [get_ports g6728]
set_output_delay -clock CK  -min 0  [get_ports g6728]
set_drive 0.5  [get_ports test_si]
set_drive 0.5  [get_ports test_se]
